app/controllers/books_controller.rb

  def index
    @user = current_user
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @user = current_user
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト"], ["body", "a"], ["user_id", 7], ["created_at", "2021-09-16 05:34:24.977370"], ["updated_at", "2021-09-16 05:34:24.977370"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "aa"], ["body", "aaaaa"], ["updated_at", "2021-09-10 13:09:33.574743"], ["id", 10]]

  def destroy
    @book = Book.find(params[:id])
    if @book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 16]]