app/controllers/users_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_id", "6dac6d8b41e6b264fc50750065d157e30fa38b2fae443b260cf55094f429"], ["introduction", "ffffffff"], ["updated_at", "2021-09-10 13:04:38.547120"], ["id", 7]]

  def ensure_corrent_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]